[Rainmeter]
@Include=#@#Framework\Window.Framework
OnRefreshAction=[!CommandMeasure "Animate" "Execute 1"]
Update=-1

[Metadata]
Name=City Search
Author=mrsalogo
Information=This skin automatically finds weather codes when a city is inputted. 
Version=1.0
License=CC BY-NC-SA 4.0

[Variables]
Window.Title=Find Weather Code
Window.Width=450
Window.Height=434
Window.CenterOnLoad=1
Window.InnerColor=210,210,210

Counter=1

Get=(?(?=.*<loc id=".*").*<loc id="(.*)".*">(.*)<)
InputCity=City Name
Selected=

@Include2=#@#Settings.inc

;========================================================
; Measures
;========================================================

;--------------------------
; Loading Animation
;--------------------------

[Animate]
Measure=Plugin
Plugin=ActionTimer
Group=Loading
ActionList1=Repeat Inc, 100, 11|Wait 100|Toggle|Wait 100|Run
ActionList2=Stop

Stop=[!DisableMeasureGroup "Loading"][!CommandMeasure "Animate" "Stop 1"][!SetVariable "Counter" "0"][!UpdateMeasureGroup "Loading"][!UpdateMeterGroup "Loading"][!HideMeterGroup "Loading"][!Update]
Run=[!CommandMeasure "Animate" "Execute 1"]
Toggle=[!SetVariable "Counter" "0"][!UpdateMeasureGroup "Loading"][!UpdateMeterGroup "Loading"][!Redraw]
Inc=[!SetVariable "Counter" "(#Counter#+1)"][!UpdateMeasureGroup "Loading"][!UpdateMeterGroup "Loading"][!Redraw]
DynamicVariables=1
UpdateDivider=-1

[MeasureCalc]
Measure=Calc
Formula=#Counter#
Group=Loading
DynamicVariables=1
UpdateDivider=-1

;--------------------------
; Validation
;--------------------------

[CheckOnSelection]
Measure=String
String=#Selected#
IfMatch=^$
IfMatchAction=[!SetOption "OkButtonText" "FontColor" "200,200,200"][!DisableMeasure "#CURRENTSECTION#"][!Update]
IfNotMatchAction=[!SetOption "OkButtonText" "FontColor" "#Window.FontColor#"][!DisableMeasure "#CURRENTSECTION#"][!Update]
IfMatchMode=1
DynamicVariables=1
Disabled=1

[CheckSelection]
Measure=String
String=#Selected#
IfMatch=^$
IfMatchAction=[!DisableMeasure "#CURRENTSECTION#"][!Update]
IfNotMatchAction=[!WriteKeyValue "Variables" "System.WeatherCode" "#Selected#" "#@#Settings.inc"][!RefreshGroup NXTWeather][!DeactivateConfig]
IfMatchMode=1
DynamicVariables=1
Disabled=1

;--------------------------
; Web Measures
;--------------------------

[MeasureLocations]
Measure=Plugin
Plugin=WebParser
URL=http://wxdata.weather.com/wxdata/search/search?where=#InputCity#
RegExp=(?siU)#Get##Get##Get##Get##Get##Get##Get##Get##Get##Get#
FinishAction=[!CommandMeasure "Animate" "Execute 2"]
DynamicVariables=1

[MeasureLoc1]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=1

[MeasureCity1]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=2

[MeasureLoc2]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=3

[MeasureCity2]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=4

[MeasureLoc3]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=5

[MeasureCity3]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=6

[MeasureLoc4]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=7

[MeasureCity4]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=8

[MeasureLoc5]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=9

[MeasureCity5]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=10

[MeasureLoc6]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=11

[MeasureCity6]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=12

[MeasureLoc7]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=13

[MeasureCity7]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=14

[MeasureLoc8]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=15

[MeasureCity8]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=16

[MeasureLoc9]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=17

[MeasureCity9]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=18

[MeasureLoc10]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=19

[MeasureCity10]
Measure=Plugin
Plugin=WebParser
URL=[MeasureLocations]
StringIndex=20

;========================================================
; Override
;========================================================

[Window.Inner.Box]
Meter=Image
ImageName=#SKINSPATH#NXT-OS\@Resources\Images\InnerBoxGrey.png
ScaleMargins=3,3,3,3
X=30
Y=102
W=(#Window.Width#-60)
H=(#Window.Height#-167)
ImageTint=#Window.InnerColor#
MouseActionCursor=0

[NXTLoadingAnimation]
Meter=BITMAP
MeasureName=MeasureCalc
BitmapImage=#@#Images\Loading5.png
BitmapFrames=12
BitmapExtend=1
BitmapZeroFrame=1
ImageTint=80,80,80
X=(#Window.Width#-86)
Y=38
Group=NXTLoading|Loading
DynamicVariables=1
UpdateDivider=-1

;========================================================
; Title Bar
;========================================================

[SearchBox]
Meter=Image
MeterStyle=Window.Element.Input.Background.Active
X=30
Y=67
W=(#Window.Width#-60)
Command=[!SetOptionGroup "List" "FontColor" "#Window.FontColor#"][!SetOptionGroup "Odd" "SolidColor" "255,255,255"][!SetOptionGroup "Even" "SolidColor" "240,240,240"][!SetVariable "Selected" ""][!SetVariable "InputCity" "$UserInput$"][!CommandMeasure "MeasureLocations" "Update"][!EnableMeasure "CheckOnSelection"][!UpdateMeasure CheckOnSelection]

[SearchBoxText]
Meter=String
MeterStyle=Window.Element.Input.DefaultText
Prefix="🔍 "
Text=#InputCity#
W=(#Window.Width#-70)

;========================================================
; List 
;========================================================

;------------------------------
; Title
;------------------------------

[TitleBar]
Meter=Image
SolidColor=230,230,230
W=(#Window.Width#-62)
H=24
X=31
Y=103

[CityNameTitle]
Meter=String
MeterStyle=Window.TextStyle
StringAlign=LeftCenter
Padding=10,0,0,0
Text=City Name
W=(#Window.Width#-193)
H=24
X=r
Y=12r

[TitleSep1]
Meter=Image
SolidColor=180,180,180
H=24
W=1
X=R
Y=-12r

[CityCodeTitle]
Meter=String
MeterStyle=Window.TextStyle
StringAlign=RightCenter
Padding=0,0,10,0
Text=Code
W=110
H=24
X=120R
Y=12r

;------------------------------
; List section
;------------------------------

;--------------
; Style
;--------------

[LeftSide]
FontSize=10
FontFace=Open Sans
FontColor=#Window.FontColor#
StringAlign=LeftCenter
AntiAlias=1
Padding=10,0,120,0
ClipString=1
X=31
Y=R
W=(#Window.Width#-192)
H=24
SolidColor=255,255,255
LeftMouseUpAction=[!SetOptionGroup "List" "FontColor" "#Window.FontColor#"][!SetOptionGroup "Odd" "SolidColor" "255,255,255"][!SetOptionGroup "Even" "SolidColor" "240,240,240"][!SetOption "#CURRENTSECTION#" "SolidColor" "#Window.SelectColor#"][!SetOption "#CURRENTSECTION#" "FontColor" "255,255,255"][!SetOption "#CURRENTSECTION#Code" "FontColor" "255,255,255"][!SetVariable Selected """[MeasureLoc#CURRENTSECTION#]"""][!EnableMeasure "CheckOnSelection"][!UpdateMEasure CheckOnSelection]
Group=List

[RightSide]
FontSize=10
FontFace=Open Sans
FontColor=#Window.FontColor#
StringAlign=RightCenter
AntiAlias=1
Padding=0,0,10,0
X=R
Y=r
W=110
H=24
Group=List

;--------------
; Meters
;--------------

[1]
Meter=String
MeterStyle=LeftSide
MeasureName=MeasureCity1
X=31
Y=140
Group=List|Odd

[1Code]
Meter=String
MeterStyle=RightSide
MeasureName=MeasureLoc1

[2]
Meter=String
MeterStyle=LeftSide
MeasureName=MeasureCity2
SolidColor=240,240,240
Group=List|Even

[2Code]
Meter=String
MeterStyle=RightSide
MeasureName=MeasureLoc2

[3]
Meter=String
MeterStyle=LeftSide
MeasureName=MeasureCity3
Group=List|Odd

[3Code]
Meter=String
MeterStyle=RightSide
MeasureName=MeasureLoc3

[4]
Meter=String
MeterStyle=LeftSide
MeasureName=MeasureCity4
SolidColor=240,240,240
Group=List|Even

[4Code]
Meter=String
MeterStyle=RightSide
MeasureName=MeasureLoc4

[5]
Meter=String
MeterStyle=LeftSide
MeasureName=MeasureCity5
Group=List|Odd

[5Code]
Meter=String
MeterStyle=RightSide
MeasureName=MeasureLoc5

[6]
Meter=String
MeterStyle=LeftSide
MeasureName=MeasureCity6
SolidColor=240,240,240
Group=List|Even

[6Code]
Meter=String
MeterStyle=RightSide
MeasureName=MeasureLoc6

[7]
Meter=String
MeterStyle=LeftSide
MeasureName=MeasureCity7
Group=List|Odd

[7Code]
Meter=String
MeterStyle=RightSide
MeasureName=MeasureLoc7

[8]
Meter=String
MeterStyle=LeftSide
MeasureName=MeasureCity8
SolidColor=240,240,240
Group=List|Even

[8Code]
Meter=String
MeterStyle=RightSide
MeasureName=MeasureLoc8

[9]
Meter=String
MeterStyle=LeftSide
MeasureName=MeasureCity9
Group=List|Odd

[9Code]
Meter=String
MeterStyle=RightSide
MeasureName=MeasureLoc9

[10]
Meter=String
MeterStyle=LeftSide
MeasureName=MeasureCity10
SolidColor=240,240,240
Group=List|Even

[10Code]
Meter=String
MeterStyle=RightSide
MeasureName=MeasureLoc10

;========================================================
; Bottom Section
;========================================================

[SelectedBox]
Meter=Image
MeterStyle=Window.Element.Input.Background
X=30
Y=(#Window.Height#-60)
W=(#Window.Width#-310)


[SelectedText]
Meter=String
MeterStyle=Window.Element.Input.DefaultText
Text=#Selected#
W=(#Window.Width#-320)


[CancelButton]
Meter=Image
MeterStyle=Window.Element.Button.Small
Y=-5r
X=7R
W=120
LeftMouseDownAction=[!DeactivateConfig]

[CancelButtonText]
Meter=String
MeterStyle=Window.Element.Button.Small.Text
Text=Cancel
X=60r
W=120

[OKButton]
Meter=Image
MeterStyle=Window.Element.Button.Small
Y=-5r
X=65r
W=120
LeftMouseDownAction=[!EnableMeasure "CheckSelection"][!Update]

[OKButtonText]
Meter=String
MeterStyle=Window.Element.Button.Small.Text
FontColor=200,200,200
Text=Select
X=60r
W=120

@Include3=#@#Framework\Input.Extension